Revit 2026 API

# FabricationConfigurationLoadServices Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<int> LoadServices(
	IList<int> serviceIds
)
```
```vb
Public Function LoadServices (
	serviceIds As IList(Of Integer)
) As IList(Of Integer)
```
```cpp
public:
IList<int>^ LoadServices(
	IList<int>^ serviceIds
)
```
```fsharp
member LoadServices :
        serviceIds : IList<int> -> IList<int>
```

#### Parameters

serviceIds IListInt32

#### Return Value

IListInt32

#### Reference

FabricationConfiguration Class

Autodesk.Revit.DB Namespace